ERM/src/Documents/EMails.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Document>
		<Properties>
			<Name>EMails</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Object</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Invoice</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Subject</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Body</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ReplyTo</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ListOfRecipients</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CreatedBy</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CreationDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ModifiedBy</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ModificationDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипТекста</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыТекстовЭлектронныхПисем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Copy</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.LDAPUsers</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Recipients</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Recipient</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.LDAPUsers</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>60</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

ERM/src/Enums/EmailType/EmailType.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>EmailType</name>
  <enumValues>
    <name>Incoming</name>
  </enumValues>
  <enumValues>
    <name>Outgoing</name>
  </enumValues>
</mdclass:Enum>

ERM/src/Enums/ТипыТекстовЭлектронныхПисем/ТипыТекстовЭлектронныхПисем.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыТекстовЭлектронныхПисем</name>
  <enumValues>
    <name>HTML</name>
  </enumValues>
  <enumValues>
    <name>ПростойТекст</name>
  </enumValues>
  <enumValues>
    <name>РазмеченныйТекст</name>
  </enumValues>
  <enumValues>
    <name>HTMLСКартинками</name>
  </enumValues>
</mdclass:Enum>

ERM/src/Documents/EMails/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТКА ЗАПОЛНЕНИЯ

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		
		Если ДанныеЗаполнения.Свойство("Recipients") Тогда
			Для Каждого СтрокаRecipient Из ДанныеЗаполнения.Recipients Цикл
				НоваяСтрокаТЧ = Recipients.Добавить();
				НоваяСтрокаТЧ.Recipient = СтрокаRecipient.Recipient;
			КонецЦикла;
		КонецЕсли;

		Если ДанныеЗаполнения.Свойство("Copies") Тогда
			Для Каждого СтрокаRecipient Из ДанныеЗаполнения.Copies Цикл
				НоваяСтрокаТЧ = Copies.Добавить();
				НоваяСтрокаТЧ.Recipient = СтрокаRecipient.Recipient;
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПЕРЕД ЗАПИСЬЮ

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ДозаполнитьРеквизитыБезДополнительныхДанных(РежимЗаписи);
	
	ПроверитьВозможностьИзменения(Отказ, РежимЗаписи);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПроверитьЗаполнениеРеквизитов(Отказ, РежимЗаписи);
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////

Процедура ДозаполнитьРеквизитыБезДополнительныхДанных(РежимЗаписи)
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Дата = ТекущаяДата();
	КонецЕсли;
	
	Subject = СокрЛП(Subject);
	Текст = СокрЛП(Текст);
	ReplyTo = СокрЛП(ReplyTo);
	
	Если ЭтоНовый() Тогда
		CreatedBy = Пользователи.ТекущийПользователь();
		CreationDate = ТекущаяДата();
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ModifiedBy) Тогда
		ModifiedBy = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ModificationDate) Тогда
		ModificationDate = ТекущаяДата();
	КонецЕсли;
	
	ИндексСтроки = 0;
	ListOfRecipients = "";
	Пока ИндексСтроки < Recipients.Количество() Цикл
		
		СтрокаТЧ = Recipients[ИндексСтроки];
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.Recipient) Тогда
			Recipients.Удалить(ИндексСтроки);
		Иначе
			//{RGS AArsentev 26.01.2017 S-E-0000048
			//ListOfRecipients = ListOfRecipients + ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТЧ.Recipient, "Mail") + ", ";
			// { RGS TAlmazova 12.04.2018 19:04:23 - 
			//Если СтрокаТЧ.Recipient = Тип("СправочникСсылка.LDAPUsers") Тогда
			Если ТипЗнч(СтрокаТЧ.Recipient) = Тип("СправочникСсылка.LDAPUsers") Тогда
			// } RGS TAlmazova 12.04.2018 19:04:24 - 
				ListOfRecipients = ListOfRecipients + ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТЧ.Recipient, "Mail") + ", ";
			Иначе
				ListOfRecipients = ListOfRecipients + СтрокаТЧ.Recipient + ", ";
			КонецЕсли;
			//}RGS AArsentev 26.01.2017 S-E-0000048
			ИндексСтроки = ИндексСтроки+1;
		КонецЕсли;
		
	КонецЦикла;
	Recipients.Свернуть("Recipient", "");
	Если Не ПустаяСтрока(ListOfRecipients) Тогда
		ListOfRecipients = Лев(ListOfRecipients, СтрДлина(ListOfRecipients) - 2);
	КонецЕсли;
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////

Процедура ПроверитьВозможностьИзменения(Отказ, РежимЗаписи)
	
	// Запретим отмену проведения, так как проведение - это отправка, а отменить отправку нельзя
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"You can not return message that was already sent!",
			ЭтотОбъект,,, Отказ);
	КонецЕсли;
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////

Процедура ПроверитьЗаполнениеРеквизитов(Отказ, РежимЗаписи)
	
	Если РежимЗаписи <> РежимЗаписиДокумента.Проведение Тогда
		Возврат;
	КонецЕсли;
	
	//Если НЕ ЗначениеЗаполнено(Object) Тогда
	//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
	//		"Object is empty!",
	//		ЭтотОбъект, "Object", , Отказ);
	//КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Subject) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"Subject is empty!",
			ЭтотОбъект, "Subject", , Отказ);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Текст) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"Body is empty!",
			ЭтотОбъект, "Текст", , Отказ);
	КонецЕсли;
	
	Если Recipients.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"Recipients are empty!",
			ЭтотОбъект, "Recipients", , Отказ);
	КонецЕсли;
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТКА ПРОВЕДЕНИЯ

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если ТипПисьма = Перечисления.EmailType.Incoming Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("You can't send an incoming email.", , , , Отказ);
		Возврат;
	КонецЕсли;
	
	// Проведение - это отправка сообщения
	//{RGS AArsentev S-E-0000019 17.01.2017
	//СистемнаяУчетнаяЗапись = РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
	ТекПользователь = Пользователи.ТекущийПользователь();
	ПользовательLDAP = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекПользователь, "ПользовательLDAP");
	Если ЗначениеЗаполнено(ПользовательLDAP) Тогда
		ПочтаПользователя = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПользовательLDAP, "Mail");
		Если ЗначениеЗаполнено(ПочтаПользователя) Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	УчетныеЗаписиЭлектроннойПочты.Ссылка
			|ИЗ
			|	Справочник.УчетныеЗаписиЭлектроннойПочты КАК УчетныеЗаписиЭлектроннойПочты
			|ГДЕ
			|	УчетныеЗаписиЭлектроннойПочты.АдресЭлектроннойПочты = &АдресЭлектроннойПочты";
			Запрос.УстановитьПараметр("АдресЭлектроннойПочты", ПочтаПользователя);
			Результат = Запрос.Выполнить();
			Если НЕ Результат.Пустой() Тогда
				Выборка = Результат.Выбрать();
				Выборка.Следующий();
				УчетнаяЗаписьПочтыПользователя = Выборка.Ссылка;
			Иначе
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Not found the account email address - " + ПочтаПользователя, ЭтотОбъект, , , Отказ);
			КонецЕсли;
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Not specified e-mail address for the LDAP user - " + ПользовательLDAP, ЭтотОбъект, , , Отказ);
		КонецЕсли;
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Not defined the LDAP account to the current user - " + ТекПользователь, ЭтотОбъект, , , Отказ);
	КонецЕсли;
	//}RGS AArsentev S-E-0000019 17.01.2017
	
	ПараметрыПисьма = Новый Структура;

	МассивСтруктурКому = Новый Массив;
	Для Каждого СтрокаТЧ Из Recipients Цикл
		//{RGS AArsentev 26.01.2017 S-E-0000048
		Если ТипЗнч(СтрокаТЧ.Recipient) <> Тип("СправочникСсылка.LDAPUsers") Тогда
			МассивСтруктурКому.Добавить(Новый Структура("Адрес, Представление", СтрокаТЧ.Recipient, , СтрокаТЧ.Recipient));
		Иначе
		//}RGS AArsentev 26.01.2017 S-E-0000048
			СтруктураРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаТЧ.Recipient, "Mail, DisplayName");
			МассивСтруктурКому.Добавить(Новый Структура("Адрес, Представление", СтруктураРеквизитов.Mail, , СтруктураРеквизитов.DisplayName));
		КонецЕсли;
	КонецЦикла; 
	ПараметрыПисьма.Вставить("Кому", МассивСтруктурКому);

	МассивСтруктурКопии = Новый Массив;
	Для Каждого СтрокаТЧ Из Copies Цикл
		//{RGS AArsentev 26.01.2017 S-E-0000048
		Если ТипЗнч(СтрокаТЧ.Recipient) <> Тип("СправочникСсылка.LDAPUsers") Тогда
			МассивСтруктурКопии.Добавить(Новый Структура("Адрес, Представление", СтрокаТЧ.Recipient, , СтрокаТЧ.Recipient));
		Иначе
		//}RGS AArsentev 26.01.2017 S-E-0000048
			СтруктураРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаТЧ.Recipient, "Mail, DisplayName");
			МассивСтруктурКопии.Добавить(Новый Структура("Адрес, Представление", СтруктураРеквизитов.Mail, , СтруктураРеквизитов.DisplayName));
		КонецЕсли;
	КонецЦикла; 
	ПараметрыПисьма.Вставить("Копии", МассивСтруктурКопии);

	ПараметрыПисьма.Вставить("Тема", 		Subject);
	ПараметрыПисьма.Вставить("Тело", 		Текст);
	ПараметрыПисьма.Вставить("АдресОтвета", ReplyTo);
	
	Если НЕ ЗначениеЗаполнено(ТипТекста) Тогда
		ПараметрыПисьма.Вставить("ТипТекста", 	Перечисления.ТипыТекстовЭлектронныхПисем.ПростойТекст);
	Иначе
		ПараметрыПисьма.Вставить("ТипТекста", 	ТипТекста);
	КонецЕсли;
	
	Если Headers.Количество() > 0 Тогда
		ПараметрыПисьма.Вставить("ПоляЗаголовка", Новый Массив());
		Для Каждого СтрокаТЧ Из Headers Цикл
			СтруктураПоляЗаголовка = Новый Структура("ИмяПоля, ЗначениеПоля, СпособКодирования",
				СтрокаТЧ.Name, СтрокаТЧ.Value, СпособКодированияНеASCIIСимволовИнтернетПочтовогоСообщения.БезКодирования);
			ПараметрыПисьма.ПоляЗаголовка.Добавить(СтруктураПоляЗаголовка);
		КонецЦикла;
	КонецЕсли;
	
	// вложения

	// { RGS AGorlenko 20.01.2017 18:01:31 - поддержка картинок
	//МассивПрисоединенныхФайлов = Новый Массив();
	//ДвоичныеДанныеФайлов.ПолучитьПрикрепленныеФайлыКОбъекту(Ссылка, МассивПрисоединенныхФайлов);
	//Если МассивПрисоединенныхФайлов.Количество() > 0 Тогда
	//	Вложения = Новый Соответствие;
	//	Для каждого ТекПрисоединенныйФайл Из МассивПрисоединенныхФайлов Цикл
	//		СтруктураДанныхФайла = ДвоичныеДанныеФайлов.ПолучитьДанныеФайла(ТекПрисоединенныйФайл);
	//		Вложения.Вставить(СтруктураДанныхФайла.ИмяФайла, СтруктураДанныхФайла.СсылкаНаДвоичныеДанныеФайла);
	//	КонецЦикла;
	//	ПараметрыПисьма.Вставить("Вложения", Вложения);
	//КонецЕсли;
	
	СоотвВложения = Новый Соответствие;

	ИмяОбъектаМетаданных = "EmailsПрисоединенныеФайлы";
	ВладелецФайлов       = Ссылка;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Файлы.Наименование КАК ПолноеНаименование,
	|	Файлы.Расширение КАК Расширение,
	|	Файлы.Ссылка КАК Ссылка,
	//|	Файлы.ЭлектронныеПодписи.(
	//|		НомерСтроки,
	//|		Подпись
	//|	),
	|	Файлы.ИДФайлаЭлектронногоПисьма
	|ИЗ
	|	Справочник." + ИмяОбъектаМетаданных + " КАК Файлы
	|ГДЕ
	|	Файлы.ВладелецФайла = &ВладелецФайла";
	Запрос.УстановитьПараметр("ВладелецФайла", ВладелецФайлов);
	Выборка = Запрос.Выполнить().Выбрать(); 

	Пока Выборка.Следующий() Цикл
		ИмяФайла = Выборка.ПолноеНаименование + ?(Выборка.Расширение = "", "", "." + Выборка.Расширение);
		Если ПустаяСтрока(Выборка.ИДФайлаЭлектронногоПисьма) Тогда
			СоотвВложения.Вставить(ИмяФайла, ПрисоединенныеФайлы.ПолучитьДвоичныеДанныеФайла(Выборка.Ссылка));
		Иначе
			СтруктураДанныеВложения = Новый Структура;
			СтруктураДанныеВложения.Вставить("ДвоичныеДанные", ПрисоединенныеФайлы.ПолучитьДвоичныеДанныеФайла(Выборка.Ссылка));
			СтруктураДанныеВложения.Вставить("Идентификатор", Выборка.ИДФайлаЭлектронногоПисьма);
			СоотвВложения.Вставить(ИмяФайла, СтруктураДанныеВложения);
		КонецЕсли;
		//Для каждого ЭП Из Выборка.ЭлектронныеПодписи.Выгрузить() Цикл
		//
		//	СоотвВложения.Вставить(Выборка.ПолноеНаименование + "-DS("+ ЭП.НомерСтроки + ")." 
		//	                       + РасширениеДляФайловПодписи,ЭП.Подпись.Получить());
		//
		//КонецЦикла;
	КонецЦикла;
	ПараметрыПисьма.Вставить("Вложения", СоотвВложения);
	ПараметрыПисьма.Вставить("ОбрабатыватьТексты", Ложь);
	// } RGS AGorlenko 20.01.2017 18:01:38 - поддержка картинок
	
	// Попробуем отправить сообщение
	ПисьмоОтправлено = Ложь;
	КоличествоПопыток = 0;
	Пока НЕ ПисьмоОтправлено И КоличествоПопыток < 3 Цикл
		
		КоличествоПопыток = КоличествоПопыток + 1;
		Попытка
			//{RGS AArsentev S-E-0000019 17.01.2017
			//РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(СистемнаяУчетнаяЗапись, ПараметрыПисьма);
			РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(УчетнаяЗаписьПочтыПользователя, ПараметрыПисьма);
			//}RGS AArsentev S-E-0000019 17.01.2017
			ИдентификаторСообщения = ПараметрыПисьма.ИдентификаторСообщения;
			ПисьмоОтправлено = Истина;
		Исключение
			ЗаписьЖурналаРегистрации(
				"Ошибка отправки E-mail",
				УровеньЖурналаРегистрации.Ошибка,
				Метаданные.Документы.EMails,
				Object,
				ОписаниеОшибки());
		КонецПопытки;
			
	КонецЦикла;

	Если НЕ ПисьмоОтправлено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"Failed to send e-mail!
			|" + ОписаниеОшибки(),
			ЭтотОбъект, , , Отказ);
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли
